//////////////////////////////////////////////////////////////////////////////////
//*----------------------------------------------------------------------------*//
//| Core Engine v1.0.0 (https://www.maus-games.at)                             |//
//*----------------------------------------------------------------------------*//
//| Copyright (c) 2013 Martin Mauersics                                        |//
//|                                                                            |//
//| This software is provided 'as-is', without any express or implied          |//
//| warranty. In no event will the authors be held liable for any damages      |//
//| arising from the use of this software.                                     |//
//|                                                                            |//
//| Permission is granted to anyone to use this software for any purpose,      |//
//| including commercial applications, and to alter it and redistribute it     |//
//| freely, subject to the following restrictions:                             |//
//|                                                                            |//
//| 1. The origin of this software must not be misrepresented; you must not    |//
//|    claim that you wrote the original software. If you use this software    |//
//|    in a product, an acknowledgment in the product documentation would be   |//
//|    appreciated but is not required.                                        |//

    void  operator delete   (void*)       = delete; \
    void  operator delete[] (void*)       = delete;

// enable bitwise-operations with the defined enumeration
#define ENABLE_BITWISE(e)                                                                                                                                       \
    constexpr e  operator ~  (const e   a)            {return s_cast<e>(~s_cast<std::underlying_type<e>::type>(a));}                                            \
    constexpr e  operator &  (const e   a, const e b) {return s_cast<e>( s_cast<std::underlying_type<e>::type>(a) & s_cast<std::underlying_type<e>::type>(b));} \
    constexpr e  operator |  (const e   a, const e b) {return s_cast<e>( s_cast<std::underlying_type<e>::type>(a) | s_cast<std::underlying_type<e>::type>(b));} \
    constexpr e  operator ^  (const e   a, const e b) {return s_cast<e>( s_cast<std::underlying_type<e>::type>(a) ^ s_cast<std::underlying_type<e>::type>(b));} \
    inline    e& operator &= (e& OUTPUT a, const e b) {return (a = a & b);}                                                                                     \
    inline    e& operator |= (e& OUTPUT a, const e b) {return (a = a | b);}                                                                                     \
    inline    e& operator ^= (e& OUTPUT a, const e b) {return (a = a ^ b);}

// safely convert pointers and references along the inheritance hierarchy
#if defined(_CORE_RTTI_)
    template <typename T, typename S> inline T coreDynamicCast(S a) {T b = dynamic_cast<T>(a); ASSERT(!a || b) return b;}
#else
    #define coreDynamicCast static_cast
#endif

// shorter common keywords
#define s_cast static_cast
#define d_cast coreDynamicCast
#define r_cast reinterpret_cast
#define c_cast const_cast

// type conversion macros
#define F_TO_SI(x) ((coreInt32)            (x))   // float to signed int
#define F_TO_UI(x) ((coreUint32)(coreInt32)(x))   // float to unsigned int (force [_mm_cvtt_ss2si])
#define I_TO_F(x)  ((coreFloat)(coreInt32) (x))   // int to float          (force [_mm_cvtepi32_ps])
#define P_TO_SI(x) ((std::intptr_t)(void*) (x))   // pointer to signed int
#define P_TO_UI(x) ((std::uintptr_t)(void*)(x))   // pointer to unsigned int
#define I_TO_P(x)  ((void*)(std::intptr_t) (x))   // int to pointer

// type definitions
using coreInt8   = std::int8_t;
using coreInt16  = std::int16_t;
using coreInt32  = std::int32_t;
using coreInt64  = long long;
using coreIntW   = std::make_signed<std::size_t>::type;
using coreLong   = long;
using coreUint8  = std::uint8_t;
using coreUint16 = std::uint16_t;
using coreUint32 = std::uint32_t;
using coreUint64 = unsigned long long;
using coreUintW  = std::size_t;
using coreUlong  = unsigned long;
using coreBool   = bool;
using coreChar   = char;
using coreChar8  = char8_t;
using coreChar16 = char16_t;
using coreChar32 = char32_t;
using coreWchar  = wchar_t;
using coreFloat  = float;
using coreDouble = double;
using coreByte   = std::uint8_t;

STATIC_ASSERT(sizeof(coreInt8)   == 1u)
STATIC_ASSERT(sizeof(coreInt16)  == 2u)
STATIC_ASSERT(sizeof(coreInt32)  == 4u)
STATIC_ASSERT(sizeof(coreInt64)  == 8u)
STATIC_ASSERT(sizeof(coreUint8)  == 1u)
STATIC_ASSERT(sizeof(coreUint16) == 2u)
STATIC_ASSERT(sizeof(coreUint32) == 4u)
STATIC_ASSERT(sizeof(coreUint64) == 8u)
STATIC_ASSERT(sizeof(coreByte)   == 1u)

struct coreUint128 final
{
    coreUint64 iLow;
    coreUint64 iHigh;
};

// retrieve compile-time string properties
constexpr coreUintW coreStrLenConst(const coreChar* s)                    {ASSERT(s)      if(std::is_constant_evaluated()) {coreUintW i = 0u; while(s[i]) ++i; return i;}                return std::strlen(s);}
constexpr coreInt32 coreStrCmpConst(const coreChar* s, const coreChar* t) {ASSERT(s && t) if(std::is_constant_evaluated()) {while((*s) == (*t) && (*s)) {++s; ++t;} return (*s) - (*t);} return std::strcmp(s, t);}

// retrieve compile-time pointer-safe array size
template <typename T, coreUintW iSize> coreByte (&__ARRAY_SIZE(T (&)[iSize]))[iSize];
#define ARRAY_SIZE(a) (sizeof(__ARRAY_SIZE(a)))

// retrieve compile-time function and lambda properties
